In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

In [2]:
database = 'UWMadisondatabase.sqlite3'

In [3]:
conn = sqlite3.connect(database)

In [4]:
cursor = conn.cursor()

In [6]:
tables = pd.read_sql("""SELECT name FROM sqlite_master
                        WHERE type= 'table'; """,conn)
tables

                  name
0             sections
1          instructors
2     course_offerings
3  subject_memberships
4              courses
5                rooms
6            teachings
7             subjects
8            schedules
9  grade_distributions

So, we have 10 tables in all.

# Analyzing the Subjects table

In [7]:
subjects = pd.read_sql("""SELECT * FROM subjects;""", conn)
subjects

    code                                  name abbreviation
0    908                          Soil Science     SOIL SCI
1    350                               ENGLISH      ENGLISH
2    351          English as a Second Language          ESL
3    230  Human Development and Family Studies         HDFS
4    352                               English         ENGL
..   ...                                   ...          ...
195  348  Engineering Professional Development        E P D
196  106                 Afro-American Studies     AFROAMER
197  228        Chicana/o and Latina/o Studies       CHICLA
198  108    Agricultural and Applied Economics        A A E
199  900                             Sociology          SOC

[200 rows x 3 columns]

In [11]:
order_subjects = pd.read_sql("""SELECT * FROM subjects
                                ORDER BY code; """, conn)
order_subjects

    code                                            name abbreviation
0    102                     Air Force Aerospace Studies     A F AERO
1    104                African Languages and Literature      AFRICAN
2    106                           Afro-American Studies     AFROAMER
3    108              Agricultural and Applied Economics        A A E
4    112                  Biological Systems Engineering          BSE
..   ...                                             ...          ...
195  960                                WILDLIFE ECOLOGY      WL ECOL
196  963                      Gender and Women’s Studies       GEN&WS
197  970                                         Zoology      ZOOLOGY
198  SAB  International Academic Programs - Study Abroad     STDYABRD
199  ZZZ                    Registrar-Administrative Use     AdminUse

[200 rows x 3 columns]

How many subjects are English based?

In [16]:
eng_sub = pd.read_sql("""SELECT * FROM subjects
                         WHERE name LIKE '%english%';""", conn)
eng_sub

  code                          name abbreviation
0  350                       ENGLISH      ENGLISH
1  351  English as a Second Language          ESL
2  352                       English         ENGL

How many subjects are Science based?

In [17]:
sci_sub = pd.read_sql("""SELECT * FROM subjects
                         WHERE name LIKE '%science%' ;""", conn)
sci_sub

   code                                             name abbreviation
0   908                                     Soil Science     SOIL SCI
1   120                      Life Sciences Communication          LSC
2   242                                Actuarial Science      ACT SCI
3   252             Communication Sciences and Disorders         CS&D
4   810                       Population Health Sciences     POP HLTH
5   934                          Comparative Biosciences     COMP BIO
6   938                                Surgical Sciences     SURG SCI
7   939  Therapeutic Science (Department of Kinesiology)     THER SCI
8   266                                Computer Sciences     COMP SCI
9   702                Ophthalmology and Visual Sciences     OPHTHALM
10  703                        Patho-Biological Sciences     PATH-BIO
11  390                                     Food Science     FOOD SCI
12  271                                 Consumer Science     CNSR SCI
13  952            ANIMAL HEALTH AND BIOMEDICAL SCIENCES        AHABS
14  718                          Pharmaceutical Sciences      PHM SCI
15  604                                  Animal Sciences       AN SCI
16  292                                    Dairy Science       DY SCI
17  622                Medical Sciences - Medical School     MED SC-M
18  623           Medical Sciences - Veterinary Medicine     MED SC-V
19  503                               Integrated Science     INTEGSCI
20  628                      CLINICAL LABORATORY SCIENCE     CLNLABSC
21  875                   Science and Technology Studies          STS
22  636                Materials Science and Engineering      M S & E
23  640                 Atmospheric and Oceanic Sciences      ATM OCN
24  644                                 Military Science      MIL SCI
25  778                                Political Science     POLI SCI
26  420                                       Geoscience       GEOSCI
27  672                                    Naval Science      NAV SCI
28  681                                     Neuroscience     NEURODPT
29  682                    Neuroscience Training Program          NTP
30  694                             Nutritional Sciences     NUTR SCI
31  456                               History of Science     HIST SCI

Which subjects are economics based?

In [19]:
eco_sub = pd.read_sql("""SELECT * FROM subjects
                         WHERE name LIKE '%economics%';""", conn)
eco_sub

  code                                  name abbreviation
0  239  Real Estate and Urban Land Economics     REAL EST
1  296                             Economics         ECON
2  108    Agricultural and Applied Economics        A A E

What all Engineering subjects are there?

In [20]:
engg_sub = pd.read_sql ("""SELECT * FROM subjects
                           WHERE name LIKE '%engineering%';""", conn)
engg_sub

   code                                     name abbreviation
0   112           Biological Systems Engineering          BSE
1   240      Civil and Environmental Engineering     CIV ENGR
2   490       Industrial and Systems Engineering       I SY E
3   496  Interdisciplinary Courses (Engineering)     INTEREGR
4   612                   Mechanical Engineering          M E
5   636        Materials Science and Engineering      M S & E
6   418                   Geological Engineering        G L E
7   320      Electrical and Computer Engineering        E C E
8   684                      Nuclear Engineering          N E
9   207                   Biomedical Engineering        B M E
10  220      Chemical and Biological Engineering          CBE
11  346   Engineering Mechanics and Astronautics        E M A
12  347                      Engineering Physics          E P
13  348     Engineering Professional Development        E P D

Which subjects are based on Literature?

In [21]:
lit_sub = pd.read_sql("""SELECT * FROM subjects
WHERE name LIKE '%literature%'; """, conn)
lit_sub

  code                                 name abbreviation
0  260               Comparative Literature     COMP LIT
1  295  East Asian Languages and Literature      E ASIAN
2  551            Literature in Translation     LITTRANS
3  104     African Languages and Literature      AFRICAN

Which subjects are Medicine based?

In [23]:
med_sub = pd.read_sql("""SELECT * FROM subjects
WHERE name LIKE '%medicine%'; """, conn)
med_sub

  code                                    name abbreviation
0  370                         Family Medicine      FAM MED
1  704       Pathology and Laboratory Medicine         PATH
2  840                 Rehabilitation Medicine     RHAB MED
3  623  Medical Sciences - Veterinary Medicine     MED SC-V
4  632                                Medicine     MEDICINE
5  330                      Emergency Medicine     EMER MED

# Analyzing the courses table

In [25]:
courses = pd.read_sql("""SELECT * FROM courses;""", conn)
courses

,uuid,name,number
0,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,Cooperative Education Program,1
1,c070a84f-648f-351d-9499-5d0e30ad02cc,Cooperative Education/Co-op in Life Sciences C...,1
2,e6b4b7ae-0e0b-3aa5-9d77-7fcd90c9cfa3,Cooperative Education Program,1
3,8f63bde1-ff7f-3fe7-9901-862908bf134c,Workshop in Dance Activity,1
4,f3541888-584a-3923-9ce7-6341ff3d84a1,Cooperative Education/Co-op in Agricultural & ...,1
...,...,...,...
9301,4a7f3d9d-f2e5-3df2-8dee-2c2d02ed9098,Conservation Planning,972
9302,1220244c-2bbf-3169-8eb0-6a2da36f40f6,"Optimizing Value, Quality and Safety in Health...",973
9303,516f637c-a244-3df0-ba3f-f11ce650543d,Patient Education as a Strategy for Advocacy,974
9304,fbe0838f-9469-3d83-ad85-91ba5aabd1a3,Multidisciplinary Approaches to Colon Cancer P...,975
9305,1b17abd5-39f9-3a2c-8eda-a88bf1871221,Independent Study,998

In [36]:
course_offerings = pd.read_sql("""SELECT * FROM course_offerings;""", conn)
course_offerings

,uuid,course_uuid,term_code,name
0,uuid,course_uuid,term_code,name
1,344b3ebe-da7e-314c-83ed-9425269695fd,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1092,Cooperative Education Prog
2,f718e6cd-33f0-3c14-a9a6-834d9c3610a8,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1082,Cooperative Education Prog
3,ea3b717c-d66b-30dc-8b37-964d9688295f,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1172,Cooperative Education Prog
4,075da420-5f49-3dd0-93df-13e3c152e1b1,a3e3e1c3-543d-3bb5-ae65-5f2aec4ad1de,1114,Cooperative Education Prog
...,...,...,...,...
81448,3573e335-e7be-33a6-b023-8704b3acc93b,4a7f3d9d-f2e5-3df2-8dee-2c2d02ed9098,1182,Conservation Planning
81449,5d437083-a1d0-38b8-aa70-ec3564da39a6,1220244c-2bbf-3169-8eb0-6a2da36f40f6,1182,null
81450,13278922-0726-3823-abda-dc14df03d8a6,516f637c-a244-3df0-ba3f-f11ce650543d,1182,Patient Ed. as Advocacy Strat.
81451,fd039fe4-32ec-31dd-a142-c7db54df784b,fbe0838f-9469-3d83-ad85-91ba5aabd1a3,1182,Multid. Appr. to Colon Cancer
81452,4e151e41-fdfb-3176-a96a-bec0715492a3,1b17abd5-39f9-3a2c-8eda-a88bf1871221,1182,null

# Finding the Subjects which the courses offered belong to

In [40]:
course_subject =pd.read_sql("""SELECT uuid, term_code, name, subject_code
                               FROM course_offerings 
                               INNER JOIN subject_memberships 
                               ON course_offerings.uuid = subject_memberships.course_offering_uuid ;""", conn)
course_subject

,uuid,term_code,name,subject_code
0,344b3ebe-da7e-314c-83ed-9425269695fd,1092,Cooperative Education Prog,220
1,344b3ebe-da7e-314c-83ed-9425269695fd,1092,Cooperative Education Prog,320
2,344b3ebe-da7e-314c-83ed-9425269695fd,1092,Cooperative Education Prog,346
3,344b3ebe-da7e-314c-83ed-9425269695fd,1092,Cooperative Education Prog,612
4,344b3ebe-da7e-314c-83ed-9425269695fd,1092,Cooperative Education Prog,636
...,...,...,...,...
95309,3573e335-e7be-33a6-b023-8704b3acc93b,1182,Conservation Planning,360
95310,5d437083-a1d0-38b8-aa70-ec3564da39a6,1182,null,936
95311,13278922-0726-3823-abda-dc14df03d8a6,1182,Patient Ed. as Advocacy Strat.,936
95312,fd039fe4-32ec-31dd-a142-c7db54df784b,1182,Multid. Appr. to Colon Cancer,936
95313,4e151e41-fdfb-3176-a96a-bec0715492a3,1182,null,330

In [44]:
course_subjects =pd.read_sql("""SELECT course_offerings.name AS course_name, subject_code, subjects.name AS subject_name
                               FROM course_offerings 
                               INNER JOIN subject_memberships 
                               ON course_offerings.uuid = subject_memberships.course_offering_uuid 
                               INNER JOIN subjects
                               ON subject_memberships.subject_code = subjects.code ;""", conn)
course_subjects

,course_name,subject_code,subject_name
0,Cooperative Education Prog,220,Chemical and Biological Engineering
1,Cooperative Education Prog,320,Electrical and Computer Engineering
2,Cooperative Education Prog,346,Engineering Mechanics and Astronautics
3,Cooperative Education Prog,612,Mechanical Engineering
4,Cooperative Education Prog,636,Materials Science and Engineering
...,...,...,...
95309,Conservation Planning,360,Environmental Studies - Gaylord Nelson Institute
95310,null,936,Surgery
95311,Patient Ed. as Advocacy Strat.,936,Surgery
95312,Multid. Appr. to Colon Cancer,936,Surgery
95313,null,330,Emergency Medicine

# Creating a view of the course_subjects table queried above :-

In [48]:
cursor.execute("DROP VIEW IF EXISTS course_subjects")
cursor.execute("""
  CREATE VIEW
  course_subjects (uuid, course_name, subject_code, subject_name)
  AS
  SELECT course_offerings.name AS course_name, subject_code, subjects.name AS subject_name
                               FROM course_offerings 
                               INNER JOIN subject_memberships 
                               ON course_offerings.uuid = subject_memberships.course_offering_uuid 
                               INNER JOIN subjects
                               ON subject_memberships.subject_code = subjects.code
  """)

# Analyzing the instructors and teachings

In [49]:
instructors = pd.read_sql("""SELECT * FROM instructors;""", conn)
instructors

            id                   name
0           id                   name
1       761703       JOHN ARCHAMBAULT
2      3677061         STEPHANIE KANN
3       788586             KATHY PREM
4      1600463     KRISTIN KLARKOWSKI
...        ...                    ...
18733   491743           MARY COLLINS
18734   952509            PAUL HUNTER
18735  3644163          MEGAN GUSSICK
18736  5841497        MICHAEL SEMANIK
18737  5906028  ALICIA BARCEINAS CRUZ

[18738 rows x 2 columns]

In [51]:
teachings = pd.read_sql("""SELECT * FROM teachings;""", conn)
teachings

       instructor_id                          section_uuid
0             761703  45adf63c-48c9-3659-8561-07556d2d4ddf
1             761703  c6280e23-5e43-3859-893e-540d94993529
2             761703  9395dc21-15d1-3fab-8d1f-6f3fe6114c48
3            3677061  b99e440b-39db-350a-81eb-b6eb1bd8b0bc
4             761703  ca1c841f-41d5-3298-bd25-01c65751f150
...              ...                                   ...
315206       5906028  78135ed6-31b3-3973-99d5-fd98ab9afef3
315207       4097737  a1972345-f931-3964-bb62-718d26e79bd4
315208       3296435  50f9cf79-a4e3-3975-a292-b130d3d5d97c
315209       5450446  f9bad9d1-197d-3c55-8199-7f05e640ddb8
315210       5713399  514908cc-af75-30b7-89db-841bf09a9de0

[315211 rows x 2 columns]

In [52]:
instructor_teachings = pd.read_sql("""SELECT id, name, section_uuid
                                      FROM instructors
                                      INNER JOIN teachings
                                      ON instructors.id = teachings.instructor_id;""", conn)
instructor_teachings

,id,name,instructor_id,section_uuid
0,761703,JOHN ARCHAMBAULT,761703,45adf63c-48c9-3659-8561-07556d2d4ddf
1,761703,JOHN ARCHAMBAULT,761703,c6280e23-5e43-3859-893e-540d94993529
2,761703,JOHN ARCHAMBAULT,761703,9395dc21-15d1-3fab-8d1f-6f3fe6114c48
3,3677061,STEPHANIE KANN,3677061,b99e440b-39db-350a-81eb-b6eb1bd8b0bc
4,761703,JOHN ARCHAMBAULT,761703,ca1c841f-41d5-3298-bd25-01c65751f150
...,...,...,...,...
315206,5906028,ALICIA BARCEINAS CRUZ,5906028,78135ed6-31b3-3973-99d5-fd98ab9afef3
315207,4097737,MARGARET SCHWARZE,4097737,a1972345-f931-3964-bb62-718d26e79bd4
315208,3296435,SARAH SULLIVAN,3296435,50f9cf79-a4e3-3975-a292-b130d3d5d97c
315209,5450446,EVIE CARCHMAN,5450446,f9bad9d1-197d-3c55-8199-7f05e640ddb8
315210,5713399,MANISH SHAH,5713399,514908cc-af75-30b7-89db-841bf09a9de0